{"index":59,"rank":0,"name":"setophaga-petechia","display":"Yellow warbler","definition":"A small, bright yellow migratory warbler that breeds throughout North and Central America.","description":"<p>The bright, sweet song of the yellow warbler is a familiar sound in streamside willows and woodland edges. </p><p>This is one of our most widely distributed warblers, nesting from the Arctic Circle to Mexico, with closely related forms along tropical coastlines.</p><p>Yellow warbler are the most extensively yellow of warblers, with golden yellow plumage and rusty streaks on the breast. </p><p>Males and females are pretty similar, with golden yellow upper parts tinged with olive, yellow under parts, and thin pointed beaks. </p><p>Males are generally brighter, especially during the breeding season. </p><p>Yellow warblers prefer moist habitats because they offer a large variety of insects. </p><p>These habitats include the edges of marshes and swamps, willow-lined streams, and leafy bogs. </p><p>Yellow warblers also inhabit dry areas such as thickets, orchards, farmlands, forest edges, and suburban yards and gardens. </p><p>They prefer areas of scattered trees, dense shrubbery and any other moist, shady areas.</p><p>Yellow warblers mostly eat insects but will occasionally also eat some berries. </p><p>They forage for insects and spiders on the limbs of trees and bushes. </p><p>Small insect larvae and caterpillars are preferred foods.</p><p>Yellow warblers usually breed in late May and early June. </p><p>They nest in trees, building a small but very sturdy cup shaped nest. </p><p>Females lay 4 to 5 eggs, incubation lasting from 10 to 14 days.</p><p>Nestling period lasts from 8 to 12 days, and parental feeding may extend to two weeks after the young leave the nest.</p><p>Females and males first attempt to breed in their first year after hatching. </p><p>Both sexes rear the young about equally, but emphasize different tasks.</p><p>Females are more involved with building and maintaining the nest, and incubating and brooding the offspring. </p><p>Males are more involved in guarding the nest site and procuring food, bringing it to the nest and passing it to the waiting mother, which does most of the actual feeding. </p><p>The song is a musical strophe that can be rendered \"sweet sweet sweet, I'm so sweet\", although it varies considerably between populations. </p><p>The call is a soft or harder \"chip or ship\". This is particularly frequently given by females after a male has finished his song.</p><p>The predators of yellow warblers are those typical of such smallish tree-nesting passerines: snakes, foxes, birds of prey, and many others.</p><p>Snakes are significant nest predators, taking nestlings and fledglings as well as sick or distracted adults.</p><p>Likewise corvids and large climbing rodents, notably the American red squirrel.</p><p>Carnivores, including the striped skunk, long-tailed weasel and common raccoon; the red fox and domestic or feral cats, are similarly opportunistic predators.</p>","images":{"cover":{"path":"atlas/setophaga-petechia/cover.png","src":"/media/atlas/wild-birds/setophaga-petechia/cover.png","caption":null},"contextual":{"path":"atlas/setophaga-petechia/contextual.jpg","src":"/media/atlas/wild-birds/setophaga-petechia/contextual.jpg","caption":null},"featured":{"path":"atlas/setophaga-petechia/featured.png","src":"/media/atlas/wild-birds/setophaga-petechia/featured.png","caption":"<p>Yellow warbler preferred foods are small insect larvae and caterpillars.</p>\n<p>Up to two-thirds of diet may be caterpillars of various kinds.</p>\n"},"icon":{"path":"atlas/setophaga-petechia/icon.jpg","src":"/media/atlas/wild-birds/setophaga-petechia/icon.jpg","caption":null}},"lastUpdated":"2020-01-26T13:55:51Z","taxonomy":[{"name":"kingdom","display":"Kingdom","value":"Animalia"},{"name":"phylum","display":"Phylum","value":"Chordata"},{"name":"class","display":"Class","value":"Aves"},{"name":"order","display":"Order","value":"Passeriformes"},{"name":"family","display":"Family","value":"Parulidae"},{"name":"genus","display":"Genus","value":"Setophaga"},{"name":"species","display":"Species","value":"Setophaga petechia"}],"aliases":["Mangrove warbler"],"spreading":[{"name":"North America","area":"ALL","less":null,"lessArea":"ALL"},{"name":"Central America","area":"ALL","less":null,"lessArea":"ALL"}],"startDate":null,"endDate":null,"conservation":"LC","sampleTitle":"Yellow warbler song","samplePath":"atlas/setophaga-petechia/sample.mp3","waveformPath":"atlas/setophaga-petechia/waveform.png","waveformSrc":"/media/atlas/wild-birds/setophaga-petechia/waveform.png","facts":[{"name":"Cowbird is a brood parasite","value":"Brown-headed cowbirds lay their eggs in the nests of yellow warblers. When yellow warbler detects \"fraud\", it builds new nest on top of already existing one and lays new set of eggs."},{"name":"Yellow warbler has black eyes","value":"Yellow warbler has black eyes, thin, pointed bill and slender body with long tail."},{"name":"Mating season in May and June","value":"Mating season of yellow warblers takes place during the May and June."},{"name":"Is a migratory bird","value":"Northern populations of yellow warblers migrate toward the south during the autumn."},{"name":"Female builds the nest","value":"Female builds cup-shaped nest made of grass and bark and lined with deer hair, feathers, dandelions and cottonwood. Nest is located on the trees or thicket, usually 30 centimeters to 1.2 meters above the ground. Construction of the nest lasts 4 days."},{"name":"Yellow warblers are monogamous","value":"Yellow warblers form monogamous couples that usually last more than one breeding season. Pair of birds produce one or two broods per year."},{"name":"Can survive around 10 years in the wild","value":"Yellow warbler can survive around 10 years in the wild."},{"name":"Males produce thousands of songs","value":"Males can produce up to 3,240 cheery, whistling songs per day to attract females. Loud, \"hissing\" calls are used to deter intruders from the occupied territories."},{"name":"Natural enemies","value":"Natural enemies of yellow warblers are snakes, squirrels, raccoons, weasels, skunks, cats, jays and crows. Webs of orb weaver spiders are death traps for the yellow warblers."},{"name":"Both parents provide for the chicks","value":"Both parents provide food for the chicks while they are in the nest (during the first 9 to 12 days) and two more weeks after fledging (until they become ready for the independent life). Yellow warblers reach sexual maturity at the age of 1 year."},{"name":"Female lays 3 to 6 greenish-white eggs","value":"Female lays 3 to 6 greenish-white eggs covered with brown spots. Eggs hatch after 10 to 13 days. Male guards the nest and provides food during the incubation period."},{"name":"Yellow warbler is an omnivore","value":"Yellow warbler is an omnivore (it eats both plants and meat). Its diet is based on insects such as leafhoppers, beetles, wasps, midges and caterpillars. Berries and juicy fruit are mostly consumed during the winter."},{"name":"Has golden-green plumage","value":"Yellow warbler has golden-green plumage on the upper side of the body and bright yellow belly. Males are more intensely colored than females and covered with reddish-brown markings on the breast and flanks."},{"name":"Can reach 18 centimeters long","value":"Yellow warbler can reach 10 to 18 centimeters in length and 7 to 25 grams of weight."},{"name":"Is a diurnal bird","value":"Yellow warbler is diurnal bird (active during the day)."}],"features":[{"name":"lifespan","value":3.1556952E8,"maximum":null,"quantity":"TIME","nameDisplay":"Lifespan","valueDisplay":"10 years"},{"name":"length","value":0.1,"maximum":0.18,"quantity":"LENGTH","nameDisplay":"Body Length","valueDisplay":"10 to 18 cm"},{"name":"wingspan","value":0.16,"maximum":0.22,"quantity":"LENGTH","nameDisplay":"Wingspan","valueDisplay":"16 to 22 cm"},{"name":"weight","value":0.007,"maximum":0.025,"quantity":"MASS","nameDisplay":"Weight","valueDisplay":"7 to 25 grams"},{"name":"elevation","value":0.0,"maximum":3000.0,"quantity":"LENGTH","nameDisplay":"Elevation","valueDisplay":"Up to 3 km"}],"related":[{"index":0,"display":"American goldfinch","definition":"The American goldfinch is a small North American bird in the finch family.","iconPath":"atlas/spinus-tristis/icon.jpg","iconSrc":null},{"index":45,"display":"Northern cardinal","definition":"A North American bird having a crested head, a short thick bill, and bright red plumage in the male.","iconPath":"atlas/cardinalis-cardinalis/icon.jpg","iconSrc":null},{"index":14,"display":"Chipping sparrow","definition":"The chipping sparrow  is a species of American sparrow, a passerine bird in the family Passerellidae.","iconPath":"atlas/spizella-passerina/icon.jpg","iconSrc":null}],"links":[{"url":"https://en.wikipedia.org/wiki/American_yellow_warbler","display":"Wikipedia","description":"Wikipedia article about yellow warbler.","iconPath":"link/wikipedia.png","iconSrc":"/media/link/wikipedia.png"},{"url":"https://ebird.org/species/yelwar/","display":"eBird","description":"eBird observations about yellow warbler.","iconPath":"link/ebird.png","iconSrc":"/media/link/ebird.png"},{"url":"https://www.britannica.com/animal/wood-warbler#ref78041","display":"Encyclopædia Britannica","description":"Wood warbler article on Britannica.","iconPath":"link/britannica.png","iconSrc":"/media/link/britannica.png"},{"url":"http://www.softschools.com/facts/animals/yellow_warbler_facts/1874/","display":"Soft Schools","description":"Yellow warbler facts on Soft Schools.","iconPath":"link/softschools.png","iconSrc":"/media/link/softschools.png"},{"url":"https://www.iucnredlist.org/species/22721657/119522791","display":"IUCN Red List","description":"IUCN Red List index of yellow warbler.","iconPath":"link/iucnredlist.png","iconSrc":"/media/link/iucnredlist.png"},{"url":"https://www.itis.gov/servlet/SingleRpt/SingleRpt?search_topic=TSN&search_value=950039#null","display":"Taxonomic Information System","description":"ITIS taxonomy for yellow warbler.","iconPath":"link/itis.png","iconSrc":"/media/link/itis.png"},{"url":"https://eol.org/pages/45511102","display":"Encyclopedia of Life","description":"Data, maps and articles about yellow warbler.","iconPath":"link/eol.png","iconSrc":"/media/link/eol.png"},{"url":"https://www.thefreedictionary.com/yellow+warbler","display":"The Free Dictionary","description":"Yellow warbler definition on dictionary.","iconPath":"link/thefreedictionary.png","iconSrc":"/media/link/thefreedictionary.png"}]}